tutorials/lagrangian/LTSReactingParcelFoam/counterFlowFlame2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    fuel
    {
        type            patch;
        nFaces          40;
        startFace       7860;
    }
    air
    {
        type            patch;
        nFaces          40;
        startFace       7900;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       7940;
    }
    frontAndBack
    {
        type            empty;
        nFaces          8000;
        startFace       8140;
    }
)

// ************************************************************************* //
